brsvh.org
#+title:Burgess Chang's Emacs Configuration
#+options: author:nil H:4 num:nil tags:t timestamp:nil toc:2
#+export_file_name: README
#+exclude_tags: nonexport
#+startup: overview
:properties:
:header-args: :comment no :lexical t :mkdirp yes :tangle (eval my-profile)
:end:

* Header :nonexport:

#+begin_src emacs-lisp
  ;;; brsvh.el --- Burgess Chang's Profile -*- lexical-binding: t; -*-

  ;; Copyright (C) 2022 Burgess Chang

  ;; Author: Burgess Chang <bsc@brsvh.org>
  ;; Keywords: internal
  ;; Package-Requires: ((emacs "29.0.50"))
  ;; Version: 0.50.0

  ;; This file is part of emacs.d.

  ;; emacs.d is free software: you can redistribute it and/or modify it
  ;; under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; emacs.d is distributed in the hope that it will be useful, but
  ;; WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
  ;; General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with emacs.d. If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; Burgess Chang's Emacs configuration.

  ;;; Code:
#+end_src

* TODO About

** TODO Why Emacs?

** TODO Why Vanila Emacs?

** TODO How literature configuration works? 

** TODO Why a monolithic configuration?

** TODO Special Thanks

* Convention

I keep the configuration file style consistent as it grows by conventions for functions, variables, key bindings, and file storage.

** Name Convention

I use a very simple function and variable naming convention.

- Public fucntions and variables should be named start with the prefix ~my-~.
- Private or internal fucntions and variables should be named start with the prefix ~my--~.

** Bind Convention

For all commands, I have created and from other packages, I bind them to *C-c* when I want to call them through a series of key combinations.

I defined a keymap named ~ctl-c-map~, just like ~ctl-x-map~, binding all commands with *C-c* as a prefix key to it.

#+begin_src emacs-lisp
  (defvar ctl-c-map (make-keymap)
    "Default keymap for C-c commands.")

  (keymap-set global-map "C-c" ctl-c-map)
#+end_src

Usually, the major mode command is bound to some key under the prefix key *C-c* and needs to hold down *Control*.  For example, *C-c C-e* is bound to ~elisp-eval-buffer~ in ~emacs-lisp-mode~, *C-c C-l* is bound to ~org-insert-link~ in ~org-mode~, etc.

So I bind the commands I need to the letter keys with *C-c* as the prefix key.  These letter keys are also used for categorization purposes.

#+begin_src emacs-lisp
  (defvar ctl-c-e-map (make-keymap)
    "Default keymap for C-c e commands.")

  (defvar ctl-c-f-map (make-keymap)
    "Default keymap for C-c f commands.")

  (defvar ctl-c-o-map (make-keymap)
    "Default keymap for C-c v commands.")

  (defvar ctl-c-v-map (make-keymap)
    "Default keymap for C-c v commands.")

  (keymap-set ctl-c-map "e" ctl-c-e-map)
  (keymap-set ctl-c-map "f" ctl-c-f-map)
  (keymap-set ctl-c-map "o" ctl-c-o-map)
  (keymap-set ctl-c-map "v" ctl-c-v-map)
#+end_src

These letter keys correspond to the following categories and usages.

- ~e~: commands for Emacs management.
- ~f~: commands for file management.
- ~v~: commands for version control.

** File Convention

The default paths used to store configuration files and persistent data are inconsistent across Emacs packages.  This isn’t just a problem with third-party packages but even with built-in packages.

Some packages put these files directly in ~user-emacs-directory~ or ~$HOME~ or in a subdirectory of either of the two or elsewhere.  Furthermore, file names that don’t provide insight into what package might have created them are sometimes used.

So I manage them myself, following the XDG Base Directory specification as much as possible.  

I have grouped the Emacs-related files into four categories.

- cache file: volatile; created by Emacs Packages.
- config file: non-volatile; created by me; I care about their content.
- data file: non-volatile; created by Emacs Packages; crossing session effective.
- state file: non-volatile; created by Emacs Packages; current session effective.

#+begin_src emacs-lisp :tangle no
  (defvar my-config-directory user-emacs-directory
    "Directory beneath which additional config files are placed.")

  (defvar my-cache-directory (let ((linux '(berkeley-unix
					    gnu
					    gnu/kfreebsd
					    gnu/linux))
				   (xdg (getenv "XDG_CACHE_HOME")))
			       (if (and (memq system-type linux) xdg)
				   (expand-file-name "emacs/" xdg)
				 user-emacs-directory))
    "Directory beneath which additional volatile files are placed.")

  (defvar my-data-directory (let ((linux '(berkeley-unix
					   gnu
					   gnu/kfreebsd
					   gnu/linux))
				  (xdg (getenv "XDG_DATA_HOME")))
			      (if (and (memq system-type linux) xdg)
				  (expand-file-name "emacs/" xdg)
				user-emacs-directory))
    "Directory beneath which additional non-volatile files are placed.")

  (defvar my-state-directory (let ((linux '(berkeley-unix
					   gnu
					   gnu/kfreebsd
					   gnu/linux))
				  (xdg (getenv "XDG_STATE_HOME")))
			      (if (and (memq system-type linux) xdg)
				  (expand-file-name "emacs/" xdg)
				user-emacs-directory))
    "Directory beneath which additional state files are placed.")
#+end_src

** Supported Environment

My operating system is GNU/Linux, and my distribution is Arch Linux.  My Emacs configuration always lives in the master branch of the Emacs code repository.

Current verbose build information about my Emacs:

#+name: emacs-build-description
#+begin_src emacs-lisp :exports results :tangle no
  (with-temp-buffer (emacs-build-description) (buffer-string))
#+end_src

The Emacs version below 29.0.50 will have some errors during startup, so this configuration only works on the master branch.  Likewise, I haven't adapted and tested it for Windows and macOS, so it may work.

* Booting Up

Let's make some necessary settings to facilitate our further personalizing Emacs.

