brsvh.org
** Early Init

After Emacs 27.0.50, Emacs supports be configured before eval ~user-init-file~.  I did not abuse the early initialization.  I configured some options for ~comp~, ~package~, and default frame in the early initialization.

*** Move Emacs Native Compilation cache to not mess up my emacs.d

Beginning from Emacs 28.0.50, Emacs support native compilation.  It greatly improves the loading speed of Emacs Lisp.  It is configuration free, but I need to move default /eln-cache// directory under ~user-emacs-directory~ to follow my [[*File Convention][File Convention]].

#+begin_src emacs-lisp :tangle no
  (startup-redirect-eln-cache (concat my-cache-directory "eln-cache/"))
#+end_src

** Preparation for literature configuration

I used org-mode to write the literature configuration(this file).  It supports extracting code blocks to code files and exporting to other file formats.

The actual loading sequence of the literature configuration is as follows:

1. Eval init file
2. Try to extract code blocks to a configuration file(Emacs Lisp file)
3. Try to eval the configuration file

To try to extract the code block to the configuration file, I declared a function that compares the update time of the literature configuration file and the configuration file to determine if it needs to be extracted.

#+begin_src emacs-lisp :tangle no
  (defun my-profile-publish (file target-file)
    "Try to export code from the literate FILE to TARGET-FILE.

  Optional argument TARGET-FILE can be used to specify a default
  export file for all source blocks.

  Return a list whose CAR is the tangled file name, and CDR is t if
  FILE is tangled, otherwise nil."
    (unless (fboundp 'org-babel-tangle-file)
      (autoload 'org-babel-tangle-file "ob-tangle"))
    (eval-when-compile
      (declare-function org-babel-tangle-file "ob-tangle"))
    (if (or (not (file-exists-p file))
	    (file-newer-than-file-p my-literate-profile my-profile))
	(cons (car (org-babel-tangle-file file target-file)) t)
      (cons target-file nil)))
#+end_src

Then the literature configuration can be loaded by loading the configuration file.

#+begin_src emacs-lisp :tangle no
  (defvar my-literate-profile (concat user-emacs-directory "brsvh.org")
    "Burgess Chang's literate configuration profile.")

  (defvar my-profile (concat my-data-directory "lisp/brsvh.el")
    "Burgess Chang's configuration profile.")

  (load (car (my-profile-publish my-literate-profile my-profile)) nil t)
#+end_src

*Notice*: the above two code blocks are not extracted into the configuration file, they actually exist in the ~user-init-file~.

** Package Management

I choose to use the built-in /package.el/ because it provides by Emacs distribution and is almost configuration free.

It can be used with a simple ~require~, and all installed packages will be activated.

#+begin_src emacs-lisp
  (require 'package)
#+end_src

Beginning at Emacs 27.0.50, package activation occurs before ~user-init-file~ is loaded but after ~early-init-file~.  So I no longer need to do package activation.  Only when the package activations failed I do it.

#+begin_src emacs-lisp
  (unless package--activated
    (package-activate-all))
#+end_src

As mentioned above, I need to put the customization of /package.el/ that affect package initialization to ~early-init-file~.  In fact, I did redirect ~package-user-dir~ in the ~early-init-file~.

#+begin_src emacs-lisp :tangle no
  ;; Beginning at Emacs 27.0.50, package initialization occurs before
  ;; `user-init-file' is loaded, but after `early-init-file', so some of
  ;; necessary options of `package' I need to set in `early-init-file'.
  (setq package-user-dir (format "%s%s/"
				 (concat my-cache-directory "elpa/")
				 emacs-version)
	package-gnupghome-dir (concat package-user-dir "gnupg/")
	;; Enable native ompilation support of packages.
	package-native-compile t
	;; Enable precompute activation actions to speed up package
	;; activatation.
	package-quickstart t
	package-quickstart-file (concat package-user-dir "loaddefs.el"))
#+end_src

*** Emacs Lisp Package Archive

By default, Emacs support downloading and installing ELPA from official archives sites, aka GNU ELPA and Non-GNU ELPA.  But these two archive repositories contain only a relatively small part of the Emacs ecosystem, so I add Milkypostman’s ELPA for convenience get more and more packages.

#+begin_src emacs-lisp
  (add-to-list 'package-archives
	       (cons "melpa" (format "http%s://melpa.org/packages/"
				     (if (gnutls-available-p) "s" "")))
	       'append)
#+end_src

*** Easy-to-use package configuration macro

In the real world of Emacs configuration, you will find many ~with-eval-after-load~, ~add-hook~, ~require~ and other blocks of Emacs Lisp.  This will seem dizzying and somewhat lengthy to write.

In the ELPA repositories, you can find several packages designed to simplify the configuration of the Emacs Lisp package by providing the macro wrapper.

The packages are well known are:

- [[https://github.com/jwiegley/use-package][use-package.el]]
- [[https://github.com/conao3/leaf.el][leaf.el]]
- [[https://git.sr.ht/~pkal/setup][setup.el]]

I choose to use [[https://github.com/jwiegley/use-package][use-package.el]], because of its long maintenance history and more users.

All that needs to be done is to ensure it has been installed from ELPA repositories, and require it.

#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
      (unless (memq 'use-package package-archive-contents)
	(package-refresh-contents))
      (package-install 'use-package))
#+end_src

If interested, you can further read follow references to learn about managing the Emacs Lisp package with other packagers.

- [[https://github.com/radian-software/straight.el#comparison-to-other-package-managers][Comparison to other package managers]]
- [[https://systemcrafters.cc/advanced-package-management/using-straight-el/][Advanced Emacs Package Management with straight.el]]
  
**** Keyword conventions for ~use-package~

I will not use some keywords for the following reasons.

- ~:bind~, ~:bind*~, ~:bind-keymap~ and ~:bind-keymap*~

  These keywords actually call the functions ~bind-key~ and ~bind-keys~ provided by [[https://github.com/jwiegley/use-package/blob/master/bind-key.el][bind-key.el]].  The [[https://github.com/jwiegley/use-package/blob/master/bind-key.el][bind-key.el]] is, as of now (October 2022), based on the ~define-key~, which has been deprecated since Emacs 29.0.50.  And it also has a lousy indentation.  For these reasons, I refused to use these keywords.  Instead, I use ~keymap-set~ to do the key binding.

- ~:custom~

  I use ~setq~ everywhere.

- ~:custom-face~

  ~:custom-face~ keyword eval ~custom-set-faces~ before ~require~ feature.  Sometimes I need set faces after require, so ~set-face-attribute~ is more flexible.

**** Deferred loading conventions for ~use-package~

[[https://github.com/jwiegley/use-package][use-package.el]] provides ~:defer~ keyword to control block to defer loading, which means eval the code of the ~use-package~ block after the specified feature has been loaded.  The ~:defer~ keyword is used to explicit emphasis defer loading.  In addition, the ~:commands~ and ~:autoload~ keywords will also implicitly defer loading by default.  So in this configuration, I will not use the ~:defer~ keyword explicitly in cases where it is not necessary.

**** Configure ~use-package~ how to expand

When using the ~:hook~ keyword to handle something to the hook, [[https://github.com/jwiegley/use-package][use-package.el]] will use an omitted hook name.  For example, ~c-mode-hook~ omitted as ~c-mode~, ~emacs-startup-hook~ omitted as ~emacs-startup~.  I'm a bit careless, and sometimes I mess things up.  So make [[https://github.com/jwiegley/use-package][use-package.el]] always use the proper hook name.

#+begin_src emacs-lisp
  (use-package use-package
    :defer t
    :init
    (setq use-package-hook-name-suffix nil))
#+end_src

