README.md


### Get package from source

For packages that are not included in ELPA, I can only download them locally to use it.  But for such packages that already have version control, I manage them through quelpa.

    (use-package quelpa
      :ensure t
      :pin melpa
      :autoload quelpa-setup-p
      :init
      (setq quelpa-dir (format "%s%s/"
    			   (concat my-cache-directory "quelpa/")
    			   emacs-version))
    
      ;; Inhibit `quelpa' update MELPA's recipes every startup.
      (setq quelpa-update-melpa-p nil)
    
      ;; Inhibit `quelpa' auto-update.
      (setq quelpa-upgrade-p nil)
    
      ;; Inhibit `quelpa' upgrade itself.
      (setq quelpa-self-upgrade-p nil) 
    
      ;; Initialize `quelpa'.
      (quelpa-setup-p))


#### Extend keyword for Easy-to-use package configuration macro

I use a keyword named `:quelpa` in `use-package` macro, it implemented by [quelpa-use-package.el](https://github.com/quelpa/quelpa-use-package).

    (use-package quelpa-use-package
      :ensure t
      :pin melpa
      :after quelpa
      :init
      (require 'quelpa-use-package))


### Update Packages

Once I have installed the packages, a new question is, how do I update them?

The interactive approach is to call `list-packages`, press `U x` in the `*Package*` buffer, and then confirm according to the prompt to update all packages.  `U` means mark all upgradable packages, `x` means perform installation of marked packages.

It works, but&#x2026;not satisfied.

So I use [auto-package-update.el](https://github.com/rranelli/auto-package-update.el) to get further simplification and automation.

    (use-package quelpa
      :ensure t
      :pin melpa
      :commands
      (quelpa-upgrade-all
       quelpa-upgrade-all-maybe))
    
    (use-package auto-package-update
      :ensure t
      :pin melpa
      :commands
      (auto-package-update-maybe auto-package-update-now)
      :init
      (defun my-auto-package-update-now ()
        "Update installed Emacs packages.
    
    Update all packages that installed from `package' and `quelap'."
        (interactive)
        (auto-package-update-now)
        (quelpa-upgrade-all))
    
      (keymap-set ctl-c-e-map "u" 'my-auto-package-update-now)
    
      ;; Move `auto-package-update' status file.
      (setq auto-package-update-last-update-day-path
    	(expand-file-name "last-update" my-state-directory))
    
      ;; Delete residual old versions
      (setq auto-package-update-delete-old-versions t)
    
      ;; Do not bother me when updates have taken place.
      (setq auto-package-update-hide-results t)
    
      ;; Update installed packages at startup if there is an update
      ;; pending.
      (auto-package-update-maybe)
      (quelpa-upgrade-all-maybe))


<a id="org8890c1d"></a>

## Inhibit saving customization to `user-init-file` by appending

Although I do not use the **Easy Customization Interface** of Emacs, some packages will use it somewhere I do not notice.

I want to keep the content of `user-init-file` and my configuration file not auto-generated, so I choose to save customizations somewhere other than my initialization file.

    (use-package cus-edit
      :defer t
      :preface
      (setq custom-file (expand-file-name "custom.el" my-state-directory))
      :when (file-exists-p custom-file)
      :init
      (load custom-file nil 'nomessage))


<a id="org683e252"></a>

## Syncing to the shell's environment variables

For one reason or another, an Emacs instance begun from the desktop may miss some PATH set in the interactive shell.  Thus, it is challenging to use utilities installed by `cargo`.  I use an excellent package named [exec-path-from-shell.el](https://github.com/purcell/exec-path-from-shell) written by Steve Purcell to solve this problem, which will synchronize PATH from the shell.

    (use-package exec-path-from-shell
      :ensure t
      :pin melpa
      :when (memq window-system '(x pgtk))
      :hook
      (emacs-startup-hook . exec-path-from-shell-initialize))


<a id="orgbf74b55"></a>

## Intelligent garbage collection

Emacs uses a fixed threshold to trigger Garbage Collection by default, which is not flexible and may cause performance degradation by triggering Garbage Collection frequently.  I use a sneaky Garbage Collection strategy to minimize Garbage Collection interference with user activity.  It is provide by [gcmh.el](https://gitlab.com/koral/gcmh), the strategy will use a low Garbage Collection threshold when idling, and set a high threshold during normal.

    (use-package gcmh
      :ensure t
      :pin gnu
      :hook (emacs-startup-hook . gcmh-mode))


<a id="org6afc0de"></a>

## UTF-8 everywhere

In the Linux world, there is a silent agreement that UTF-8 is the best encoding to use for Unicode.  So I use utf8 by default, unless I explicitly specify the encoding.

    (use-package mule-cmds
      :commands
      (set-language-environment
       set-default-coding-systems
       prefer-coding-system)
      :init
      (set-language-environment "utf-8")
      (set-default-coding-systems 'utf-8)
      (prefer-coding-system 'utf-8))


<a id="orgf3a710b"></a>

## Using Emacs as a server

When I invoke Emacs at other places, I want to share buffers, a command history, or additional information with the existing Emacs process.  So it is necessary to make Emacs start as a daemon.

    (use-package server
      :autoload server-running-p
      :config
      (setq server-auth-dir
    	(expand-file-name "server/" my-state-directory))
      :hook
      ;; Start server at startup.
      (emacs-startup-hook
       . (lambda ()
           (eval-when-compile (require 'server))
           (unless (server-running-p) (server-start)))))


<a id="orgab2f2ab"></a>

## Resarting Emacs

When I change the configuration file, and in some other cases, I want to be able to restart Emacs instead of turning it off and on again.

    (use-package restart-emacs
      :ensure t
      :pin melpa
      :commands restart-emacs
      :init
      (keymap-set ctl-c-e-map "r" 'restart-emacs))


<a id="orgfadd56a"></a>

# Common Library

There are some shared libraries need to setup, mainly related to file of libraries saving.

[svg-lib.el](https://github.com/rougier/svg-lib) is used to provides a lot of icons in **svg** format, it will save the cache of icons to a directory under `user-emacs-directory`.  Make it follow my [File Convention](#orgb52a69a).

    (use-package svg-lib
      :ensure t
      :pin gnu
      :defer t
      :config
      (setq svg-lib-icons-dir
    	(expand-file-name "svg-lib/" my-cache-directory)))

[transient.el](https://github.com/magit/transient) implements abstraction involving a prefix command, infix arguments and suffix commands, it used to create interface for command-line program.  It will save levels, values, and history to a directory named *transient* under `user-emacs-directory`, make it follow my [File Convention](#orgb52a69a).

    (use-package transient
      :ensure t
      :pin melpa
      :defer t
      :config
      (setq transient-history-file
    	(expand-file-name "transient/history.el" my-state-directory)
    	transient-levels-file
    	(expand-file-name "transient/levels.el" my-state-directory)
    	transient-values-file
    	(expand-file-name "transient/values.el" my-state-directory)))


<a id="orge6d4a2b"></a>

# Appearance

The default interface of Emacs is old-fashioned and old-school, and I'm a young person, so I want it to be more modern.  I used a more luminous Theme and Mode Line.
