brsvh.org
** Change the default frame layout

Emacs support work on graphical and non-graphical frames.  Frame layout will show a menu bar, tool bar, and vertical scroll bar by default.  The exception is the tool bar and vertical scroll bar are not displayed in the character-only frame.

Although the menu bar, tool bar, and scroll bar are practical, my operation flow is purely keyboard-based.  For me, they are rarely used and distract me, so I disable them.

Another unimportant reason is that they are initialized before eval the init file(after ~before-init-hook~), which slow down Emacs startup.  Emacs will also get speedup by disabling them.

I handle anonymous functions to disable these bars to ~emacs-startup~hook~.

#+begin_src emacs-lisp :tangle no
  (use-package menu-bar
    :defer t
    :hook
    (emacs-startup-hook . (lambda () (menu-bar-mode -1))))

  (use-package tool-bar
    :defer t
    :hook
    (emacs-startup-hook . (lambda () (tool-bar-mode -1))))

  (use-package scroll-bar
    :defer t
    :hook
    (emacs-startup-hook . (lambda () (scroll-bar-mode -1))))
#+end_src

*** Change the default frame layout during early initialization

If you notice that Emacs enable bars after ~before-init-hook~, I disable bars at ~emacs-startup-hook~ in the previous paragraph.

This looks strange, so I turn them off by setting ~default-frame-alist~ in the ~early-init-file~.

#+begin_src emacs-lisp :tangle no
  ;; Add some essentia layout parameters of frame to preset values, and
  ;; ensure the minor modes corresponding to follow values are disabled.
  (push (cons 'menu-bar-lines nil) default-frame-alist)
  (push (cons 'tool-bar-lines nil) default-frame-alist)
  (push (cons 'vertical-scroll-bars nil) default-frame-alist)
  (push (cons 'horizontal-scroll-bars nil) default-frame-alist)
  (setq-default menu-bar-mode nil tool-bar-mode nil scroll-bar-mode nil)
#+end_src

** Change the default startup screen

Emacs will display *GNU Emacs* buffer that is not useful.  I use *scratch* buffer as default screen and clean the content of it and echo area.

#+begin_src emacs-lisp
  (use-package startup
    :no-require t
    :init
    (setq inhibit-startup-screen t
	  inhibit-startup-echo-area-message t
	  initial-scratch-message nil
	  initial-major-mode 'fundamental-mode))
#+end_src

** Resize pixelwise

I preferred resize frame and window pixelwise rather linewise.

#+begin_src emacs-lisp
  (use-package emacs
    :no-require t
    :init
    ;; Resize windows pixelwise.
    (setq window-resize-pixelwise t)

    ;; Resize frame pixelwise.
    (setq frame-resize-pixelwise t))
#+end_src

** Accessible themes

Emacs' default theme leaves much to be desired: It does not look sleek and shiny, which usually leaves first-timers with a poor, shallow impression of the system.  Below I set up a theme that makes Emacs look accessible.

#+begin_src emacs-lisp
  (use-package modus-themes
    :ensure t
    :pin gnu
    :autoload
    (modus-themes-load-themes
     modus-themes-load-operandi
     modus-themes-load-vivendi)
    :init
    (setq modus-themes-bold-constructs t
	  modus-themes-italic-constructs t
	  modus-themes-subtle-line-numbers t
	  modus-themes-inhibit-reload t
	  modus-themes-fringes 'nil
	  modus-themes-mode-line '(borderless moody)
	  modus-themes-markup '(background italic)
	  modus-themes-links '(italic neutral-underline)
	  modus-themes-prompts '(intense bold)
	  modus-themes-headings
	  '((0 . (rainbow 1.5))
	    (1 . (rainbow 1.3))
	    (2 . (rainbow 1.2))
	    (3 . (rainbow 1.1))
	    (t . (rainbow))))
    (modus-themes-load-themes)
    :config
    (modus-themes-load-operandi)
    ;; Set more subtle line numbers.
    (when (member 'modus-operandi custom-enabled-themes)
      (let ((bg (face-attribute 'modus-themes-hl-line :background)))
	(set-face-attribute 'line-number-current-line
			    nil
			    :background bg))))
#+end_src

If you look at the themes built into the Emacs distribution, you will see that /modus-themes.el/ are included in the emacs distribution.  But I always get the latest theme from ELPA.

*** Show subtle line numbers

In Modus Themes, their background colors are not uniform when both ~display-line-numbers-mode~ and ~hl-line-mode~ are activated.  I have them displaying the same background color, which looks more subtle.

#+begin_src emacs-lisp
  (use-package modus-themes
    :ensure t
    :pin gnu
    :config
    (let ((bg (face-attribute 'modus-themes-hl-line :background)))
      (set-face-attribute 'line-number-current-line nil :background bg)))
#+end_src

** Tabs and Ribbons style Mode Line

The Mode Line is a part near the bottom of Emacs that gives information about the current buffer, such as encoding, buffer size, cursor position, major mode and minor mode.

I use [[https://github.com/tarsius/moody][moody.el]] to get a tabs and ribbons style mode line.  Its advantage is only making modest changes to the mode line, adding or replacing only a few elements.

#+begin_src emacs-lisp
  (use-package moody
    :ensure t
    :pin melpa
    :autoload
    (moody-replace-mode-line-buffer-identification
     moody-replace-vc-mode
     moody-replace-eldoc-minibuffer-message-function)
    :init
    ;; Replace elements of Mode Line.
    (moody-replace-mode-line-buffer-identification)
    (moody-replace-vc-mode)
    (moody-replace-eldoc-minibuffer-message-function))

  (use-package emacs
    :no-require t
    :init
    ;; Inhibit draw the underline at the same place as the descent line.
    (setq x-underline-at-descent-line t))
#+end_src

*** Replace Minor Modes with a menu button

When a buffer activates so many minor modes, the Mode Line will show many names of minor modes.  It isn't charming because usually too long mode info messages can cause other information to be outside the scope of the frame.

I use [[https://github.com/tarsius/minions][minions.el]] to replace the minor modes list with a menu button that lists enabled minor modes.

#+begin_src emacs-lisp
  (use-package minions
    :ensure t
    :pin melpa
    :defines minions-prominent-modes
    :init
    ;; Show button as :)
    (setq minions-mode-line-lighter ":)"
	  minions-mode-line-delimiters '("" . ""))
    :hook (emacs-startup-hook . minions-mode))
#+end_src

~minions-prominent-modes~ is used to show minor mode directly in the mode line.

** Context Menu

Emacs support clicking the mouse button activates the menu whose contents depends on its surrounding context.  But it is disabled by default, sometimes it helps me, so I activated it at startup.

#+begin_src emacs-lisp
  (use-package mouse
    :hook (emacs-startup-hook . context-menu-mode))
#+end_src

** Smooth Scrolling

smooth scrolling, as its name indicates, is a feature that allows you to scroll smoothly. The default scrolling is a bit choppier, so I use ~pixel-scroll-mode~.

#+begin_src emacs-lisp
  (use-package pixel-scroll
    :hook
    ((emacs-startup-hook . pixel-scroll-mode)
     (emacs-startup-hook . pixel-scroll-precision-mode)))
#+end_src

** Highlighting changes

Highlighting uncommitted changes on the fringe.

#+begin_src emacs-lisp
  (use-package diff-hl
    :ensure t
    :pin gnu
    :hook
    (find-file-hook . diff-hl-mode)
    (vc-dir-mode-hook  . diff-hl-dir-mode)
    (dired-mode-hook   . diff-hl-dired-mode)
    (diff-hl-mode-hook . diff-hl-flydiff-mode))
#+end_src

