brsvh.org
* Completion

Emacs provides a *Completion* feature that fills in the rest of a name starting from an abbreviation for it.  I usually fill in two types of Emacs when I need to fill in.

- *input completion*: completion of my input in the minibuffer
- *text completion*: completion of words or abbreviations in a buffer.

When I fill in both types of content, I usually want them to have different interfaces.  I prefer input completions to show candidates in the minibuffer, while text completions provide a pop-up menu in place.

There are so many input completion packages in ELPA repositories, available for me to choose from [[https://github.com/emacs-helm/helm][helm.el]], [[https://github.com/abo-abo/swiper][ivy.el]], [[https://github.com/radian-software/selectrum][selectrum.el]], [[https://github.com/minad/vertico][vertico.el]], etc.

I have used all these packages for a long or short time.  I choose to use [[https://github.com/minad/vertico][vertico.el]] finally.  Because it achieves full compatibility with built-in Emacs completion commands and completion tables by reusing the built-in facilities system.

And for text completion, less choice, [[https://github.com/company-mode/company-mode][company.el]] and [[https://github.com/minad/corfu][corfu.el]].  Because [[https://github.com/minad/corfu][corfu.el]] relies exclusively on the standard Emacs completion API, [[https://github.com/company-mode/company-mode][company.el]] defines its own API for the backends.  So I use [[https://github.com/minad/corfu][corfu.el]] other than [[https://github.com/company-mode/company-mode][company.el]].

** Allow recursive edit in minibuffer

By default, Emacs do not allow a new minibuffer in the current minibuffer.  It inconveniences many everyday tasks, such as viewing the documentation for a command before executing it or invoking the shell command ~date~ when calling ~find-file~ to create a file containing the current date.

I set ~enable-recursive-minibuffers~ to ~t~ to allow use recursive minibuffer.

#+begin_src emacs-lisp
  (use-package emacs
    :no-require t
    :init
    (setq enable-recursive-minibuffers t))
#+end_src

** Hide commands in M-x which do not work in the current mode

My Emacs contains thousands of commands, and I want to hide some commands that are not available in the current main mode to avoid interfering with my command completion.

In particular, note that this only works on Emacs after 28.0.50.

#+begin_src emacs-lisp
  (use-package simple
    :defer t
    :config
    (setq read-extended-command-predicate
	  #'command-completion-default-include-p))
#+end_src

** Do not allow the cursor in the minibuffer prompt

Keep cursor outside of any ~cursor-intangible~ text property.

#+begin_src emacs-lisp
  (use-package emacs
    :no-require t
    :init
    (setq minibuffer-prompt-properties
	  '(read-only t cursor-intangible t face minibuffer-prompt)))

  (use-package cursor-sensor
    :hook
    (minibuffer-setup-hook . cursor-intangible-mode))
#+end_src

** Eye-catching indicator when calling ~completing-read-multiple~

Add prompt indicator when calling ~completing-read-multiple~, it will display ~[CRM<separator>]~, e.g., ~[CRM,]~ if the separator is a comma.

#+begin_src emacs-lisp
  (use-package crm
    :defer t
    :config
    (define-advice completing-read-multiple
	(:filter-args (args) my-crm-indicator)
      "Parsing ARGS and add my prompt indicator.

  \(fn PROMPT TABLE &optional PREDICATE REQUIRE-MATCH INITIAL-INPUT HIST DEF INHERIT-INPUT-METHOD)"
      (cons (format "[CRM%s] %s"
		    (replace-regexp-in-string
		     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
		     crm-separator)
		    (car args))
	    (cdr args))))
#+end_src

** Match completion with space

Emacs supports the set of completion styles, with these three types enabled by default: ~basic~, ~emacs22~, and ~partial-completion~.

They are corresponding to:

- basic: completion of the prefix before point and the suffix after point.
- emacs22: prefix completion that only operates on the text before point.
- partial-completion: completion of multiple words, each one taken as a prefix.

For example, if there is a command ~foo-bar~, it could be complete with these inputs:

- ~f_b~, complete by basic style
- ~f_r~, complete by emacs22 style
- ~f-_a~, complete by partial-completion style.

~_~ is mean the position of cursor.

Although the default is sufficient, I would like to be allowed to complete the input with spaces as separators.  So  I use [[https://github.com/oantolin/orderless][orderless]], which provides a completion style named ~orderless~ that divides the pattern into space-separated components and match them.

#+begin_src emacs-lisp
  (use-package minibuffer
    :ensure orderless
    :pin gnu
    :init
    ;; Use orderless style get more flexible completions.
    (setq completion-styles '(substring orderless basic)
	  completion-category-overrides
	  '((file (styles basic partial-completion)))))
#+end_src

Additionally, enable ~partial-completion~ for file path expansion.  ~partial-completion~ is vital for file wildcard support.  Multiple files can be opened at once with ~find-file~ if the input has a wildcard.

** Use vertical completion UI with [[https://github.com/minad/vertico][vertico.el]]

[[https://github.com/minad/vertico][vertico.el]] provides a minor mode named ~vertico-mode~ (Vertico Mode), which will wrap ~completing-read~ to set a vertical UI after activate it.

*Vertico Mode* is easy to use.  It just needs to be activated.  I handle it to ~emacs-startup-hook~ for auto-activated at startup.

#+begin_src emacs-lisp :tangle no
  (use-package vertico
    :ensure t
    :pin gnu
    :hook
    (emacs-startup-hook . vertico-mode))
#+end_src

After activating Vertico Mode, it will display a fixed height minibuffer when completing.  I preferred to use an adjustable height based on the remaining candidates.

Another point needs to be tweaked.  When I go to the last candidate, I need help getting back to the top quickly. I enable cycling of ~vertico-next~ and ~vertico-previous~.

#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :pin gnu
    :config
    ;; Grow and shrink the Vertico minibuffer
    (setq vertico-resize t)

    ;; enable cycling for `vertico-next' and `vertico-previous'.
    (setq vertico-cycle t)
    :hook
    (emacs-startup-hook . vertico-mode))
#+end_src

*** Ido-like directory navigation

~find-file~ will open the current directory of files by default, so editing the path of ~find-file~ is a widespread operation, and by default, I can only delete one character at a time. That is too awful and will wear out my patience. [[https://github.com/minad/vertico][vertico.el]] has an extension named ~vertico-directory~, which provides some commands to delete multiple characters in the path at once by word.  I bind these commands to backspace.

#+begin_src emacs-lisp
  (use-package vertico-directory
    :ensure vertico
    :pin gnu
    :after vertico
    :autoload
    (vertico-directory-enter
     vertico-directory-delete-char
     vertico-directory-delete-word)
    :init
    (keymap-set vertico-map "<return>" 'vertico-directory-enter)
    (keymap-set vertico-map "<backspace>" 'vertico-directory-delete-char)
    (keymap-set vertico-map "M-<backspace>" 'vertico-directory-delete-word)
    :hook
    ;; Tidy shadowed file names.
    (rfn-eshadow-update-overlay-hook . vertico-directory-tidy))
#+end_src

*** Use Mouse select candidate

I occasionally use the mouse, and this is why I want to use the mouse to select the candidates.

#+begin_src emacs-lisp
  (use-package vertico-mouse
    :ensure vertico
    :pin gnu
    :after vertico
    :hook
    (vertico-mode-hook . vertico-mouse-mode))
#+end_src

