brsvh.org
** Completion Overlay Region FUnction

I use [[https://github.com/minad/corfu][corfu.el]] to pop up the completion of text at a point.

#+begin_src emacs-lisp :tangle no
  (use-package corfu
    :ensure t
    :pin gnu
    :commands corfu-mode)
#+end_src

Because I avoid using too many global modes and only complete text when programming, ~corfu-mode~ is handled in the hook of the programming major mode.  As you see, I autoload the command and do not activate it.

*Corfu Mode* works as a wrapper of ~complete-symbol~, so I need press ~C-M-i~ to do complete.  Let it pop up the completion menu automatically.

#+begin_src emacs-lisp :tangle no
  (use-package corfu
    :ensure t
    :pin gnu
    :commands corfu-mode
    :config
    (setq corfu-auto t
	  corfu-quit-no-match 'separator))
#+end_src

*Corfu Mode* jumping between candidates with ~corfu-perivous~ and ~corfu-next~.  When I got to the last candidate, I wanted the next one to return to the first one, so I activated cycling for ~corfu-perivous~ and ~corfu-next~.

#+begin_src emacs-lisp :tangle no
  (use-package corfu
    :ensure t
    :pin gnu
    :commands corfu-mode
    :config
    ;; Enable auto completion
    (setq corfu-auto t
	  corfu-quit-no-match 'separator)

    ;; Enable cycling for `corfu-next' and `corfu-previous'.
    (setq corfu-cycle t))
#+end_src

When I selected an incorrect candidate and quit completion, it has been fill in the point.  It will waste my time to delete it, so I prevent candidate preselection.

#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :pin gnu
    :commands corfu-mode
    :config
    ;; Enable auto completion
    (setq corfu-auto t
	  corfu-quit-no-match 'separator)

    ;; Enable cycling for `corfu-next' and `corfu-previous'.
    (setq corfu-cycle t)

    ;; Disable candidate preselection.
    (setq corfu-preselect-first nil))
#+end_src

*** Tab style completion

Complete text by just pressing the ~TAB~ key is a more efficient operation.

#+begin_src emacs-lisp
  (use-package corfu
    :defer t
    :config
    ;; TAB-style keybindings.
    (keymap-set corfu-map "<tab>" 'corfu-next)
    (keymap-set corfu-map "<backtab>" 'corfu-previous))
#+end_src

*** Work in character-only frame

[[https://github.com/minad/corfu][corfu.el]] was created on the top of ~posframe~, so it only works in the graphical frame.  Sometimes I will use Emacs in the character-only frame (terminal).  I need help to complete the text at this time.  Unsurprisingly, the powerhouse Emacs community already has a ready-made package named [[https://codeberg.org/akib/emacs-corfu-terminal][corfu-terminal.el]].

This package provides a global minor mode named ~corfu-terminal-mode~ to replace ~posframe~ with ~popup~.  The only drawback is that it is global, I rewrite it to a minor mode.  The only drawback is that it is global.  I have rewritten it to a non-global minor mode.

#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :pin gnu
    :autoload
    (corfu--popup-show
     corfu--popup-hide
     corfu--popup-support-p))

  (use-package corfu-terminal
    :ensure t
    :pin nongnu
    :unless (display-graphic-p)
    :autoload (corfu-terminal--popup-show
	       corfu-terminal--popup-hide
	       corfu-terminal--popup-support-p)
    :preface
    (define-minor-mode my-corfu-terminal-mode
      "Corfu popup on terminal."
      :global nil
      :group 'corfu-terminal
      (if my-corfu-terminal-mode
	  (progn
	    (advice-add #'corfu--popup-show :around
			#'corfu-terminal--popup-show)
	    (advice-add #'corfu--popup-hide :around
			#'corfu-terminal--popup-hide)
	    (advice-add #'corfu--popup-support-p :override
			#'corfu-terminal--popup-support-p))
	(advice-remove #'corfu--popup-show #'corfu-terminal--popup-show)
	(advice-remove #'corfu--popup-hide #'corfu-terminal--popup-hide)
	(advice-remove #'corfu--popup-support-p
		       #'corfu-terminal--popup-support-p)))
    :hook
    (corfu-mode-hook . my-corfu-terminal-mode))
#+end_src

Now I can complete text in terminal.

*** Remember selected candidates and to improve sorting

When I write code in an actual project, some functions or variables need to be completed more often than others. So I would like *Corfu Mode* can do this based on the frequency of use.

#+begin_src emacs-lisp
  (use-package corfu-history
    :ensure corfu
    :pin gnu
    :hook
    (corfu-mode-hook . corfu-history-mode))
#+end_src

*** Show documentation when select candidate

[[https://github.com/galeo/corfu-doc][corfu-doc.el]] provides a minor mode that display a documentation popup for completion candidate when using *Corfu Mode*, it helped me tremendously to complete the text.

#+begin_src emacs-lisp
  (use-package corfu-doc
    :ensure t
    :pin melpa
    :after corfu
    :config
    (keymap-set corfu-map "M-d" 'corfu-doc-toggle)
    (keymap-set corfu-map "M-n" 'corfu-doc-scroll-up)
    (keymap-set corfu-map "M-p" 'corfu-doc-scroll-down)
    :hook (corfu-mode-hook . corfu-doc-mode))
#+end_src

*** Completion in the miniubuffer

I frequently use ~eval-expression~ (~M-:~) to temporary eval code, make it can be complete with *Corfu Mode*.

#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :pin gnu
    :preface
    (defun my-corfu-in-minibuffer ()
      "Enable Corfu in the minibuffer if `completion-at-point' is bound."
      (when (where-is-internal #'completion-at-point
			       (list (current-local-map)))
	(corfu-mode +1)))
    :hook
    (minibuffer-setup-hook . my-corfu-in-minibuffer))
#+end_src

*** Beautify with identifiable icon

Some functions and variables are named similarly when writing code, and I need to distinguish them visually.  I use [[https://github.com/jdtsmith/kind-icon][kind-icon.el]] to add some colorful icon before candidates.

#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :pin gnu
    :defines corfu-margin-formatters)

  (use-package kind-icon
    :ensure t
    :pin gnu
    :after corfu
    :autoload kind-icon-margin-formatter
    :init
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
    :config
    ;; Compute blended backgrounds correctly.
    (setq kind-icon-default-face 'corfu-default))
#+end_src

** Show mariginalia of completions

I use [[https://github.com/minad/marginalia][marginalia.el]] get more helpful infomation of completion.

#+begin_quote
[[https://en.wikipedia.org/wiki/Marginalia][Marginalia]] are marks or annotations placed at the margin of the page of a book or in this case helpful colorful annotations placed at the margin of the minibuffer for your completion candidates.[fn:1]
#+end_quote

#+begin_src emacs-lisp
  (use-package marginalia
    :ensure t
    :pin gnu
    :config
    ; Make marginalia align to right.
    (setq marginalia-align 'right)
    :hook
    (emacs-startup-hook . marginalia-mode))
#+end_src

* Actions in Emacs

For me, there are some commands in Emacs that I consider to actions.  Such as opening the URL in a browser, switching to other buffers, searching for something, and operating them.  So I need quickly find these actions and enhance them for me.

** Save actions history

When I do some actions and quit Emacs later, the history of actions will be lost.  I have to retype everything, and it upsets me.  So I activate ~savehist-mode~ to persist everything typed in the minibuffer.

#+begin_src emacs-lisp
  (use-package savehist
    :config
    (setq savehist-file (expand-file-name "hist.el" my-state-directory))
    ;; Auto delete duplicated history.
    (setq history-delete-duplicates t)
    :hook (emacs-startup-hook . savehist-mode))
#+end_src

