README.md


<a id="orgea7e98c"></a>

## Completion Overlay Region FUnction

I use [corfu.el](https://github.com/minad/corfu) to pop up the completion of text at a point.

    (use-package corfu
      :ensure t
      :pin gnu
      :commands corfu-mode)

Because I avoid using too many global modes and only complete text when programming, `corfu-mode` is handled in the hook of the programming major mode.  As you see, I autoload the command and do not activate it.

**Corfu Mode** works as a wrapper of `complete-symbol`, so I need press `C-M-i` to do complete.  Let it pop up the completion menu automatically.

    (use-package corfu
      :ensure t
      :pin gnu
      :commands corfu-mode
      :config
      (setq corfu-auto t
    	corfu-quit-no-match 'separator))

**Corfu Mode** jumping between candidates with `corfu-perivous` and `corfu-next`.  When I got to the last candidate, I wanted the next one to return to the first one, so I activated cycling for `corfu-perivous` and `corfu-next`.

    (use-package corfu
      :ensure t
      :pin gnu
      :commands corfu-mode
      :config
      ;; Enable auto completion
      (setq corfu-auto t
    	corfu-quit-no-match 'separator)
    
      ;; Enable cycling for `corfu-next' and `corfu-previous'.
      (setq corfu-cycle t))

When I selected an incorrect candidate and quit completion, it has been fill in the point.  It will waste my time to delete it, so I prevent candidate preselection.

    (use-package corfu
      :ensure t
      :pin gnu
      :commands corfu-mode
      :config
      ;; Enable auto completion
      (setq corfu-auto t
    	corfu-quit-no-match 'separator)
    
      ;; Enable cycling for `corfu-next' and `corfu-previous'.
      (setq corfu-cycle t)
    
      ;; Disable candidate preselection.
      (setq corfu-preselect-first nil))


### Tab style completion

Complete text by just pressing the `TAB` key is a more efficient operation.

    (use-package corfu
      :defer t
      :config
      ;; TAB-style keybindings.
      (keymap-set corfu-map "<tab>" 'corfu-next)
      (keymap-set corfu-map "<backtab>" 'corfu-previous))


### Work in character-only frame

[corfu.el](https://github.com/minad/corfu) was created on the top of `posframe`, so it only works in the graphical frame.  Sometimes I will use Emacs in the character-only frame (terminal).  I need help to complete the text at this time.  Unsurprisingly, the powerhouse Emacs community already has a ready-made package named [corfu-terminal.el](https://codeberg.org/akib/emacs-corfu-terminal).

This package provides a global minor mode named `corfu-terminal-mode` to replace `posframe` with `popup`.  The only drawback is that it is global, I rewrite it to a minor mode.  The only drawback is that it is global.  I have rewritten it to a non-global minor mode.

    (use-package corfu
      :ensure t
      :pin gnu
      :autoload
      (corfu--popup-show
       corfu--popup-hide
       corfu--popup-support-p))
    
    (use-package corfu-terminal
      :ensure t
      :pin nongnu
      :unless (display-graphic-p)
      :autoload (corfu-terminal--popup-show
    	     corfu-terminal--popup-hide
    	     corfu-terminal--popup-support-p)
      :preface
      (define-minor-mode my-corfu-terminal-mode
        "Corfu popup on terminal."
        :global nil
        :group 'corfu-terminal
        (if my-corfu-terminal-mode
    	(progn
    	  (advice-add #'corfu--popup-show :around
    		      #'corfu-terminal--popup-show)
    	  (advice-add #'corfu--popup-hide :around
    		      #'corfu-terminal--popup-hide)
    	  (advice-add #'corfu--popup-support-p :override
    		      #'corfu-terminal--popup-support-p))
          (advice-remove #'corfu--popup-show #'corfu-terminal--popup-show)
          (advice-remove #'corfu--popup-hide #'corfu-terminal--popup-hide)
          (advice-remove #'corfu--popup-support-p
    		     #'corfu-terminal--popup-support-p)))
      :hook
      (corfu-mode-hook . my-corfu-terminal-mode))

Now I can complete text in terminal.


### Remember selected candidates and to improve sorting

When I write code in an actual project, some functions or variables need to be completed more often than others. So I would like **Corfu Mode** can do this based on the frequency of use.

    (use-package corfu-history
      :ensure corfu
      :pin gnu
      :hook
      (corfu-mode-hook . corfu-history-mode))


### Show documentation when select candidate

[corfu-doc.el](https://github.com/galeo/corfu-doc) provides a minor mode that display a documentation popup for completion candidate when using **Corfu Mode**, it helped me tremendously to complete the text.

    (use-package corfu-doc
      :ensure t
      :pin melpa
      :after corfu
      :config
      (keymap-set corfu-map "M-d" 'corfu-doc-toggle)
      (keymap-set corfu-map "M-n" 'corfu-doc-scroll-up)
      (keymap-set corfu-map "M-p" 'corfu-doc-scroll-down)
      :hook (corfu-mode-hook . corfu-doc-mode))


### Completion in the miniubuffer

I frequently use `eval-expression` (`M-:`) to temporary eval code, make it can be complete with **Corfu Mode**.

    (use-package corfu
      :ensure t
      :pin gnu
      :preface
      (defun my-corfu-in-minibuffer ()
        "Enable Corfu in the minibuffer if `completion-at-point' is bound."
        (when (where-is-internal #'completion-at-point
    			     (list (current-local-map)))
          (corfu-mode +1)))
      :hook
      (minibuffer-setup-hook . my-corfu-in-minibuffer))


### Beautify with identifiable icon

Some functions and variables are named similarly when writing code, and I need to distinguish them visually.  I use [kind-icon.el](https://github.com/jdtsmith/kind-icon) to add some colorful icon before candidates.

    (use-package corfu
      :ensure t
      :pin gnu
      :defines corfu-margin-formatters)
    
    (use-package kind-icon
      :ensure t
      :pin gnu
      :after corfu
      :autoload kind-icon-margin-formatter
      :init
      (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
      :config
      ;; Compute blended backgrounds correctly.
      (setq kind-icon-default-face 'corfu-default))


<a id="org26ec335"></a>

## Show mariginalia of completions

I use [marginalia.el](https://github.com/minad/marginalia) get more helpful infomation of completion.

> [Marginalia](https://en.wikipedia.org/wiki/Marginalia) are marks or annotations placed at the margin of the page of a book or in this case helpful colorful annotations placed at the margin of the minibuffer for your completion candidates.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>

    (use-package marginalia
      :ensure t
      :pin gnu
      :config
      ; Make marginalia align to right.
      (setq marginalia-align 'right)
      :hook
      (emacs-startup-hook . marginalia-mode))


<a id="org6c6919e"></a>

# Actions in Emacs

For me, there are some commands in Emacs that I consider to actions.  Such as opening the URL in a browser, switching to other buffers, searching for something, and operating them.  So I need quickly find these actions and enhance them for me.


<a id="org888884b"></a>

## Save actions history

When I do some actions and quit Emacs later, the history of actions will be lost.  I have to retype everything, and it upsets me.  So I activate `savehist-mode` to persist everything typed in the minibuffer.

    (use-package savehist
      :config
      (setq savehist-file (expand-file-name "hist.el" my-state-directory))
      ;; Auto delete duplicated history.
      (setq history-delete-duplicates t)
      :hook (emacs-startup-hook . savehist-mode))
