brsvh.org
** Switch buffer with preview

At this point, in addition to memorizing their differences, I'd like to preview them briefly before switching between them.  I use a command named ~consult-buffer~ provide by [[https://github.com/minad/consult][consult.el]] instead of the default ~switch-to-buffer~.

#+begin_src emacs-lisp
  (use-package consult
    :ensure t
    :pin gnu
    :commands consult-buffer
    :init
    (keymap-substitute global-map 'switch-to-buffer 'consult-buffer))
#+end_src

** Avaiable actions menu

In one place, I may execute some commands.  Rather than binding all the relevant commands to a series of keystrokes and memorizing it, I prefer to have an interactive menu pop up for me to select it.  So I use [[https://github.com/oantolin/embark][embark.el]] to show actions (commands) relevant to the target around point.  It provides a context menu of commands.

#+begin_src emacs-lisp
  (use-package embark
    :ensure t
    :pin gnu
    :commands
    (embark-act
     embark-dwim)
    :init
    (keymap-set global-map "C-;" 'embark-act)
    (keymap-set global-map "C-'" 'embark-dwim))
#+end_src

This will show all available actions on the current point by pressing ~C-;~,  and call the last action again by pressing ~C-'~.

*** Hide Mode Line in ~embark~ buffers

When I use ~embark-collect~ and ~embark-live~, I hope hide the Mode Line.

#+begin_src emacs-lisp
  (use-package window
    :defer t
    :init
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
		 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
		   nil
		   (window-parameters (mode-line-format . none)))))
#+end_src

*** Collect with preview

Automatic preview at point in the Embark Collect buffer.

#+begin_src emacs-lisp
  (use-package consult
    :ensure t
    :pin gnu
    :commands consult-preview-at-point-mode)

  (use-package embark
    :ensure embark-consult
    :commands embark-collect-mode
    :hook
    (embark-collect-mode-hook . consult-preview-at-point-mode))
#+end_src

** Help Actions

When I get confused about using Emacs, I use a series of help commands built into Emacs to solve my confusion.  But ... it is not enough.  So I need some better third-party help commands to help me learn about more things.

*** Show avaiable bindings

Sometimes I need get the description of ~embark-act~ bindings.

#+begin_src emacs-lisp
  (use-package embark
    :ensure t
    :pin melpa
    :commands embark-bindings
    :init
    (keymap-set help-map "C-b" 'embark-bindings))
#+end_src

*** Describe keymap

Emacs has a built-in command named ~describe-keymap~, but it is not bind to any key by default.  It is useful, I bind it to ~C-h C-k~.

#+begin_src emacs-lisp
  (use-package help-fns
    :commands describe-keymap
    :init
    (keymap-set help-map "C-k" 'describe-keymap))
#+end_src

*** Search available bindings

Some people use [[https://github.com/justbur/emacs-which-key][which-key.el]], which provides a popup buffer to display all available key bindings.  I used to use it too.  Although it shows bindings as much as possible, I need help finding a command when I have many bindings.  I use ~embark-prefix-help-command~ provides by [[https://github.com/oantolin/embark][embark.el]] to search binding with a ~completing-read~ interface.

#+begin_src emacs-lisp
  (use-package embark
    :ensure t
    :pin gnu
    :commands embark-prefix-help-command)

  (use-package emacs
    :no-require t
    :init
    (setq prefix-help-command #'embark-prefix-help-command))
#+end_src

** Adjust scrolling distance

Emacs will scroll more than half of the screen when I am at the bottom of the buffer and want to continue down.  It causes the focus of my eyes to leave the bottom of the buffer.

#+begin_src emacs-lisp
  (use-package emacs
    :no-require t
    :init
    ;; Automatically adjust ‘window-vscroll’ to view tall lines.
    (setq auto-window-vscroll nil)

    ;; Accelerate scrolling operations
    (setq fast-but-imprecise-scrolling t)

    ;; Kell current position after screen scroll.
    (setq scroll-preserve-screen-position t)

    ;; When at the bottom or top of the buffer, move only one line.
    (setq scroll-margin 0 scroll-conservatively 101)

    ;; Horizontally scrolling threshold.
    (setq hscroll-margin 2 hscroll-step 1))
#+end_src

** Mouse actions

As with most graphics software, Emacs has mouse interactions, some of which are difficult to use and inadequate.  I've tweek them to make the interactions feel more subtle.

** Drag and Drop

#+begin_quote
In computer graphical user interfaces, drag and drop is a pointing device gesture in which the user selects a virtual object by "grabbing" it and dragging it to a different location or onto another virtual object.[fn:2]
#+end_quote

I mostly drag and drop text with mouse.

#+begin_src emacs-lisp
  (use-package mouse
    :config
    (setq mouse-drag-and-drop-region 'control))
#+end_src

** Mouse yank at point

Mouse yank commands yank at point instead of at click.

#+begin_src emacs-lisp
  (use-package mouse
    :config
    (setq mouse-yank-at-point t))
#+end_src

** Search actions

I use [[https://github.com/minad/consult][consult.el]] to improve search commands with preview.

#+begin_src emacs-lisp
  (use-package consult
    :ensure t
    :pin gnu
    :commands
    (consult-find
     consult-grep
     consult-keep-lines
     consult-line
     consult-ripgrep
     consult-locate
     consult-git-grep
     consult-focus-lines
     consult-line-multi
     consult-multi-occur)
    :init
    (keymap-set search-map "f" 'consult-find)
    (keymap-set search-map "g" 'consult-grep)
    (keymap-set search-map "k" 'consult-keep-lines)
    (keymap-set search-map "l" 'consult-line)
    (keymap-set search-map "r" 'consult-ripgrep)
    (keymap-set search-map "M-f" 'consult-locate)
    (keymap-set search-map "M-g" 'consult-git-grep)
    (keymap-set search-map "M-k" 'consult-focus-lines)
    (keymap-set search-map "M-l" 'consult-line-multi)
    (keymap-set search-map "M-o" 'consult-multi-occur))
#+end_src

** Goto actions

I also use [[https://github.com/minad/consult][consult.el]] to improve goto commands with preview.

#+begin_src emacs-lisp
  (use-package consult
    :ensure t
    :pin gnu
    :commands
    (consult-global-mark
     consult-goto-line
     consult-imenu
     consult-imenu-multi
     consult-mark
     consult-outline)
    :init
    (keymap-substitute goto-map 'goto-line 'consult-goto-line)
    (keymap-substitute goto-map 'imenu 'consult-imenu)
    (keymap-set goto-map "m" 'consult-mark)
    (keymap-set goto-map "o" 'consult-outline)
    (keymap-set goto-map "M-i" 'consult-imenu-multi)
    (keymap-set goto-map "M-m" 'consult-global-mark))
#+end_src

* Use Emacs as general text editor

Emacs is an integrated computing environment, but it also has some features of the modern text editor.  Such as auto-saving, backup, and remote accessing.

And Emacs is a visual editor.  That means that I have a representation of my entire document on your screen, and I can move around freely, editing any part of the document I wish.  So I've also enhanced some visual features of the text.

