README.md


<a id="orgbf7f72f"></a>

## Switch buffer with preview

At this point, in addition to memorizing their differences, I'd like to preview them briefly before switching between them.  I use a command named `consult-buffer` provide by [consult.el](https://github.com/minad/consult) instead of the default `switch-to-buffer`.

    (use-package consult
      :ensure t
      :pin gnu
      :commands consult-buffer
      :init
      (keymap-substitute global-map 'switch-to-buffer 'consult-buffer))


<a id="org9f70768"></a>

## Avaiable actions menu

In one place, I may execute some commands.  Rather than binding all the relevant commands to a series of keystrokes and memorizing it, I prefer to have an interactive menu pop up for me to select it.  So I use [embark.el](https://github.com/oantolin/embark) to show actions (commands) relevant to the target around point.  It provides a context menu of commands.

    (use-package embark
      :ensure t
      :pin gnu
      :commands
      (embark-act
       embark-dwim)
      :init
      (keymap-set global-map "C-;" 'embark-act)
      (keymap-set global-map "C-'" 'embark-dwim))

This will show all available actions on the current point by pressing `C-;`,  and call the last action again by pressing `C-'`.


### Hide Mode Line in `embark` buffers

When I use `embark-collect` and `embark-live`, I hope hide the Mode Line.

    (use-package window
      :defer t
      :init
      ;; Hide the mode line of the Embark live/completions buffers
      (add-to-list 'display-buffer-alist
    	       '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
    		 nil
    		 (window-parameters (mode-line-format . none)))))


### Collect with preview

Automatic preview at point in the Embark Collect buffer.

    (use-package consult
      :ensure t
      :pin gnu
      :commands consult-preview-at-point-mode)
    
    (use-package embark
      :ensure embark-consult
      :commands embark-collect-mode
      :hook
      (embark-collect-mode-hook . consult-preview-at-point-mode))


<a id="org7cc44d9"></a>

## Help Actions

When I get confused about using Emacs, I use a series of help commands built into Emacs to solve my confusion.  But &#x2026; it is not enough.  So I need some better third-party help commands to help me learn about more things.


### Show avaiable bindings

Sometimes I need get the description of `embark-act` bindings.

    (use-package embark
      :ensure t
      :pin melpa
      :commands embark-bindings
      :init
      (keymap-set help-map "C-b" 'embark-bindings))


### Describe keymap

Emacs has a built-in command named `describe-keymap`, but it is not bind to any key by default.  It is useful, I bind it to `C-h C-k`.

    (use-package help-fns
      :commands describe-keymap
      :init
      (keymap-set help-map "C-k" 'describe-keymap))


### Search available bindings

Some people use [which-key.el](https://github.com/justbur/emacs-which-key), which provides a popup buffer to display all available key bindings.  I used to use it too.  Although it shows bindings as much as possible, I need help finding a command when I have many bindings.  I use `embark-prefix-help-command` provides by [embark.el](https://github.com/oantolin/embark) to search binding with a `completing-read` interface.

    (use-package embark
      :ensure t
      :pin gnu
      :commands embark-prefix-help-command)
    
    (use-package emacs
      :no-require t
      :init
      (setq prefix-help-command #'embark-prefix-help-command))


<a id="orgb7b0fb4"></a>

## Adjust scrolling distance

Emacs will scroll more than half of the screen when I am at the bottom of the buffer and want to continue down.  It causes the focus of my eyes to leave the bottom of the buffer.

    (use-package emacs
      :no-require t
      :init
      ;; Automatically adjust ‘window-vscroll’ to view tall lines.
      (setq auto-window-vscroll nil)
    
      ;; Accelerate scrolling operations
      (setq fast-but-imprecise-scrolling t)
    
      ;; Kell current position after screen scroll.
      (setq scroll-preserve-screen-position t)
    
      ;; When at the bottom or top of the buffer, move only one line.
      (setq scroll-margin 0 scroll-conservatively 101)
    
      ;; Horizontally scrolling threshold.
      (setq hscroll-margin 2 hscroll-step 1))


<a id="org0a31c20"></a>

## Mouse actions

As with most graphics software, Emacs has mouse interactions, some of which are difficult to use and inadequate.  I've tweek them to make the interactions feel more subtle.


<a id="org04ddd60"></a>

## Drag and Drop

> In computer graphical user interfaces, drag and drop is a pointing device gesture in which the user selects a virtual object by "grabbing" it and dragging it to a different location or onto another virtual object.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>

I mostly drag and drop text with mouse.

    (use-package mouse
      :config
      (setq mouse-drag-and-drop-region 'control))


<a id="orga65eb18"></a>

## Mouse yank at point

Mouse yank commands yank at point instead of at click.

    (use-package mouse
      :config
      (setq mouse-yank-at-point t))


<a id="orgaa2078d"></a>

## Search actions

I use [consult.el](https://github.com/minad/consult) to improve search commands with preview.

    (use-package consult
      :ensure t
      :pin gnu
      :commands
      (consult-find
       consult-grep
       consult-keep-lines
       consult-line
       consult-ripgrep
       consult-locate
       consult-git-grep
       consult-focus-lines
       consult-line-multi
       consult-multi-occur)
      :init
      (keymap-set search-map "f" 'consult-find)
      (keymap-set search-map "g" 'consult-grep)
      (keymap-set search-map "k" 'consult-keep-lines)
      (keymap-set search-map "l" 'consult-line)
      (keymap-set search-map "r" 'consult-ripgrep)
      (keymap-set search-map "M-f" 'consult-locate)
      (keymap-set search-map "M-g" 'consult-git-grep)
      (keymap-set search-map "M-k" 'consult-focus-lines)
      (keymap-set search-map "M-l" 'consult-line-multi)
      (keymap-set search-map "M-o" 'consult-multi-occur))


<a id="org1fc9e62"></a>

## Goto actions

I also use [consult.el](https://github.com/minad/consult) to improve goto commands with preview.

    (use-package consult
      :ensure t
      :pin gnu
      :commands
      (consult-global-mark
       consult-goto-line
       consult-imenu
       consult-imenu-multi
       consult-mark
       consult-outline)
      :init
      (keymap-substitute goto-map 'goto-line 'consult-goto-line)
      (keymap-substitute goto-map 'imenu 'consult-imenu)
      (keymap-set goto-map "m" 'consult-mark)
      (keymap-set goto-map "o" 'consult-outline)
      (keymap-set goto-map "M-i" 'consult-imenu-multi)
      (keymap-set goto-map "M-m" 'consult-global-mark))


<a id="org800d598"></a>

# Use Emacs as general text editor

Emacs is an integrated computing environment, but it also has some features of the modern text editor.  Such as auto-saving, backup, and remote accessing.

And Emacs is a visual editor.  That means that I have a representation of my entire document on your screen, and I can move around freely, editing any part of the document I wish.  So I've also enhanced some visual features of the text.
