brsvh.org
** Automatic Backups

By default, Emacs saves backup files —those ending in ~— in the current directory, thereby cluttering it up.  Let's place them in a directory follow my [[*File Convention][File Convention]].

I want to keep multiple versions of my backup files to help keep my sanity.  Emacs allow saving an unlimited number of backups, but keeping a backup of five versions is appropriate.

#+begin_src emacs-lisp
  (use-package files
    :defer t
    :config
    ;; Create backup files for each modified file on saving, and enable
    ;; make multiple numbered backup files.
    (setq make-backup-files t
	  version-control t)

    ;; Make backup files using the old file replication.
    (setq backup-by-copying t)

    ;; Adjust the threshold for automatic deletion of versioned backup
    ;; files.
    (setq delete-old-versions t
	  kept-old-versions 5
	  kept-new-versions 5)

    ;; Prevent create backup files in-place, alternative create them in
    ;; `my-data-directory'.
    (setq backup-directory-alist
	  (append `(("."
		     .
		     ,(expand-file-name "backup/" my-data-directory)))
		  backup-directory-alist)))
#+end_src

You may have noticed that I set ~backup-by-copying~ to ~t~, which makes Emacs create backups by copying from the original file.  This differs from the default method, which creates backups by renaming the original file.

** Automatic Saving

By default, Emacs automatically saves your changes to a file intermittently.  If anything should happen, you can recover a file with ~M-x recover-file~.

And Emacs will create the auto-saved file with a name appending *#* to the front and rear of the visited file name in place.  I want to keep the directory clean, and follow my [[*File Convention][File Convention]].  So I push my customized transform for rule of making auto-save file name to ~auto-save-file-name-transforms~.

#+begin_src emacs-lisp
  (use-package files
    :defer t
    :config
    ;; Enable Auto-saving.
    (setq auto-save-default t)

    ;; Disable the message of auto-saving.
    (setq auto-save-no-message t)

    ;; Don't auto-disable auto-save after deleting big chunks.  This
    ;; defeats the purpose of a failsafe.
    (setq auto-save-include-big-deletions t)

    ;; Change default transforms to apply to buffer file name before
    ;; making auto-save file name.
    (setq auto-save-file-name-transforms
	  (append `((".*"
		     ,(expand-file-name "auto-save/" my-data-directory)
		     t))
		  auto-save-file-name-transforms)))
#+end_src

Deleting a substantial portion of the text disables auto-save in the buffer by default.  Thus, if I make many changes and my computer suddenly fails, all my changes will be lost, so save all changes anyway.  For always failsafe to take precedence, I have to set ~auto-save-include-big-deletions~ to ~t~.

After auto-saved files have been created, Emacs will save paths of all auto-saved files to a file named the value of ~auto-save-list-file-name~.  Make it follow my [[*File Convention][File Convention]].

#+begin_src emacs-lisp
  (use-package startup
    :no-require t
    :init
    (setq auto-save-list-file-prefix
	  (expand-file-name "auto-save/session/" my-data-directory)))
#+end_src

** Recent Files

Same as criminals always return to the scene of the crime, I also reopen file from time to time when I am done hacking code or writing articles.  Remembering the path to the file and recalling ~find-file~ is tedious.  Fortunately, Emacs provides *Recentf Mode* to facilitate our return to the crime scene.  It will maintain and persist a list of recent files, I call ~recentf-open~ to get this list after activate *Recentf Mode*.

#+begin_src emacs-lisp :tangle no
  (use-package recentf
    :hook (emacs-startup-hook . recentf-mode))
#+end_src

The list of recented files will store in ~user-emacs-directory~ by default, make it follow my [[*File Convention][File Convention]].  In addition, I use an incredible command named ~consult-recent-file~ provided by [[https://github.com/minad/consult][consult.el]] to give a preview of recent files.

#+begin_src emacs-lisp :tangle no
  (use-package consult
    :ensure t
    :pin gnu
    :commands (consult-recent-file))

  (use-package recentf
    :init
    (setq recentf-save-file
	  (expand-file-name "recent.el" my-state-directory))
    (keymap-set ctl-c-f-map "r" 'consult-recent-file)
    :hook (emacs-startup-hook . recentf-mode))
#+end_src

*Recentf Mode* will print some message in echo area at Emacs startup, like:

#+begin_example
Loading /org/brsvh/bsc/.local/state/emacs/recent.el (source)...done
Cleaning up the recentf list...done (0 removed)
#+end_example

It isn't enjoyable and doesn't help, so I created some advice to stop it from appearing.

#+begin_src emacs-lisp
  (use-package consult
    :ensure t
    :pin gnu
    :commands (consult-recent-file))

  (use-package recentf
    :init
    (setq recentf-save-file
	  (expand-file-name "recent.el" my-state-directory))
    (keymap-set ctl-c-f-map "r" 'consult-recent-file)
    :config
    (define-advice recentf-load-list
	(:around (fn &rest args) silence-message)
      "Silencing load message."
      (cl-letf (((symbol-function #'message) #'ignore))
	(apply fn args)))

    (define-advice recentf-cleanup
	(:around (fn &rest args) silence-message)
      "Silencing clean up message."
      (cl-letf (((symbol-function #'message) #'ignore))
	(apply fn args)))
    :hook (emacs-startup-hook . recentf-mode))
#+end_src

** Show basic information of buffer

The basic capabilities of the text editor should include showing basic information of buffer.  For me, they are the number of current line and column, the size of current buffer(file).

#+begin_src emacs-lisp
  (use-package simple
    :hook
    ((emacs-startup-hook . column-number-mode)
     (emacs-startup-hook . line-number-mode)
     (emacs-startup-hook . size-indication-mode)))
#+end_src

** Save the last opened place

After I modified a file, I saved and closed it.  Emacs will go to the top line of the file when next opened.  After I modified a file, I saved and closed it.  Emacs will go to the top line of the file when next opened.  I'm always trying to find where the last revision went.  To avoid this hassle, I used Save Place Mode to save the last place of the file before closing it.

#+begin_src emacs-lisp
  (use-package saveplace
    :config
    (setq save-place-file
	  (expand-file-name "place.el" my-state-directory))
    :hook (emacs-startup-hook . save-place-mode))
#+end_src

Make date storage of /saveplace.el/ follow my [[*File Convention][File Convention]].

** Replace region with new content

Emacs will append the new content to the marked region by default, which goes against operational intuition.

#+begin_src emacs-lisp
  (use-package delsel
    :hook
    ;; Replace content in marked region with new text.
    (emacs-startup-hook . delete-selection-mode))
#+end_src

** Display file name with forward style

When I opened two files that have same name, the buffers of these files will append parent directory name with brackets.  It looks different form the Unix/Linux file path, I preferred to use forward style.

#+begin_src emacs-lisp
  (use-package uniquify
    :init
    ;; Use forward style buffer name.
    (setq uniquify-buffer-name-style 'forward))
#+end_src

