README.md


<a id="org8561f25"></a>

## Kill ring and Clipboard

The **kill ring** is a list of blocks of text that were previously killed. And the **clipboard** is the facility that most graphical applications use for *cutting and pasting*.  I would like to make the kill ring of Emacs and the clipboard of system use the same content.  So I need set Emacs save kill ring to clipboard after quit.

    (use-package simple
      :config
      ;; Do not saves duplicates in kill-ring
      (setq kill-do-not-save-duplicates t)
    
      ;; Save clipboard after quit.
      (setq save-interprogram-paste-before-kill t))

I set `kill-do-not-save-duplicates` to `t`, it will remove duplicated content in the kill ring.


<a id="orga9cbb53"></a>

# File Management

Emacs can be used as a file manager, in addition to local file management, there is also rich remote protocol support.  I use Emacs as file management client to operate files, and version control.


<a id="org1b8e32d"></a>

## Version Control

**Version Control** is is a class of systems responsible for managing changes to computer programs, documents, large web sites, or other collections of information.

Widely used version control software includes **Git**, **Subversion**, **Mercurial**, and etc.


#### Git support

[magit.el](https://github.com/magit/magit) is a complete text-based user interface to [Git](https://git-scm.com/), it is the world's best Git client.

    (use-package magit
      :ensure t
      :pin nongnu
      :commands magit-dispatch
      :init
      (setq magit-define-global-key-bindings nil)
      (keymap-set ctl-c-v-map "g" 'magit-dispatch))


#### Update highlighting view after `magit` commit

`diff-hl` do not refresh fringe after changes have been committed with `magit`, handle refresh functions of `diff-hl` in related `magit` hooks.

    (use-package magit
      :ensure t
      :pin nongnu
      :defines
      (magit-pre-refresh-hook
       magit-post-refresh-hook))
    
    (use-package diff-hl
      :ensure t
      :pin gnu
      :hook
      ((magit-pre-refresh-hook . diff-hl-magit-pre-refresh)
       (magit-post-refresh-hook . diff-hl-magit-post-refresh)))


<a id="org11b9d3e"></a>

# Life with `org-mode`

My life can be seen as a combination of mechanical tasks, the planning and finishing of which make up my day.  It's easier to estimate how long a task takes if I keep track of time spent by *clocking in and out* of tasks.

All my **Org** files stored in the *org* directory under the `HOME` directory.

    (use-package org
      :ensure t
      :pin gnu
      :defer t
      :config
      (setq org-directory "~/org"))


<a id="org20982c7"></a>

## Using `org-mode` as a Day Planner

I started realizing my [GTD methodology](https://en.wikipedia.org/wiki/Getting_Things_Done) from [Nicolas Pretton's post](https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html) as a starting point.  I call my GTD methodology as **Day Planner**.

My workflow of the day planner with the following steps:

1.  Mindlessly capture and collect tasks.
2.  Schedule and archive tasks at the end, or start, of the day.
3.  Document in detail the tasks I encounter problems or ideas while doing them.
4.  Repeat!

I use *org-agenda.el* to show my tasks by time or category and bind related commands to my customized global key map.

    (use-package org-agenda
      :ensure org
      :pin gnu
      :commands org-agenda
      :init
      (keymap-set ctl-c-o-map "a" 'org-agenda))


<a id="org4ef6d9c"></a>

## Files of Day Planner

I split all my tasks in four separate files:

-   *~/org/agenda/inbox.org*: where I collect everything;
-   *~/org/agenda/gtd.org*: where I put all my projects;
-   *~/org/agenda/someday.org*: All inactive tasks that I might do at some point in the future, but don’t want to see all the time;
-   *~/org/agenda/tickler.org*: I put entries in this file with a timestamp to get reminded at the right moment.

And it is necessary to add these files to the agenda file.

    (use-package org-agenda
      :ensure org
      :pin gnu
      :defer t
      :config
      (add-to-list 'org-agenda-files "~/org/agenda/inbox.org")
      (add-to-list 'org-agenda-files "~/org/agenda/gtd.org")
      (add-to-list 'org-agenda-files "~/org/agenda/tickler.org"))

My inbox is then processed and emptied daily.  When processing the inbox, I refile each entry that is actionable and belongs to a project using `C-c C-w`, moving the entry to the appropriate place.  If need be, I create a new project out of it.  These are rules for refile entry.

    (use-package org-refile
      :ensure org
      :pin gnu
      :defer t
      :config
      (add-to-list 'org-refile-targets
    	       '("~/org/agenda/gtd.org" :maxlevel . 3))
      (add-to-list 'org-refile-targets
    	       '("~/org/agenda/someday.org" :level . 1))
      (add-to-list 'org-refile-targets
    	       '("~/org/agenda/tickler.org" :maxlevel . 2)))


<a id="orge684067"></a>

## Capture and collect tasks

As mentioned above, I use the inbox as a pre-processing place for all tasks.  So I needed a quick way to capture tasks to the inbox, and *org-capture.el* provided it.

    (use-package org-capture
      :ensure org
      :pin gnu
      :commands org-capture
      :init
      (keymap-set ctl-c-o-map "c" 'org-capture)
      :config
      ;; Task.
      (add-to-list 'org-capture-templates
    	       '("t"
    		 "Todo [inbox]"
    		 entry
    		 (file+headline "~/org/agenda/inbox.org" "Tasks"))
    	       'append)
    
      ;; Tickler
      (add-to-list 'org-capture-templates
    	       '("T"
    		 "Tickler"
    		 entry
    		 (file+headline "~/org/agenda/tickler.org" "Tickler"))
    	       'append))


<a id="org249f288"></a>

# Prose

Emacs is a writer's best friend, the rich extensions from the Emacs community and the extensibility of Emacs itself offer endless possibilities for writing.


<a id="orgcb28342"></a>

## Generic writing experience improvements for text of Prose

I've thought about what I need from Emacs to support me while working on my literary creations.  They just include **Text Wrap** and **Spell Check** now.

I always use soft wrap when I need to wrap text, and it is **Visual Line Mode** in Emacs to provide this support.

    (use-package simple
      :hook
      (text-mode-hook . hl-line-mode))
    
    (use-package hl-line
      :hook
      (text-mode-hook . visual-line-mode))

As you see, I also need highlight current line when wirte prose.

There are multiple choices for Spell Check in Emacs, *ispell.el* or *flyspell.el*.

`ispell-word` is bind to `M-$` by default, it is configure free and I don't need setup it.  So I just handle `flyspell-mode` to `text-mode-hook`, it will be available in other writing modes that inherit from `text-mode`.

    (use-package flyspell
      :hook
      (text-mode-hook . flyspell-mode))


### Wrap Multi-language Text

I am a Chinese native speaker, so I frequently write English and Chinese at the same time.  They will have strange line breaks wrap in Emacs, so it is necessary to set `word-wrap-by-category` to get correct word wrap for me.  It is useful for Korean and Japanese too.

    (use-package simple
      :config
      (setq word-wrap-by-category t))


<a id="org23391a5"></a>

## Distraction-free writing

Writing takes total concentration to produce creative prose.  Distractions are the natural enemy of concentration.  While my computer is my most important writing tool, it can also be a source of distractions.

Distraction-free writing means that the computer screen is free of clutter and, just like an old typewriter, only shows the text is working on.

[olivetti.el](https://github.com/rnkn/olivetti) is a simple Emacs minor mode that facilities distraction-free writing.  I use it when need full concentration writing in other marjor modes.

    (use-package olivetti
      :ensure t
      :pin melpa
      :commands olivetti-mode)
