README.md


<a id="org6fb32d0"></a>

## Write article with `org-mode`

**Org Mode** is a GNU Emacs major mode for org file format editing, and org file format is markup text language with rich features.  Most of my plain text files are written in org file format.  I export them to other file formats via `ox`.  Let's tweak it now.


### Beautify Org Mode

Org mode needs some tweaks to remove some clutter from the screen.  We can change the alignment, change the way fonts of rich text and special characters are displayed and preview images by default.

    (use-package org
      :ensure t
      :pin gnu
      :defer t
      :config
      ;; Show entities as UTF8 characters.
      (setq org-pretty-entities t)
    
      ;;Hide emphasis markers 
      (setq org-hide-emphasis-markers t)
    
      ;; Show inline image.
      (setq org-startup-with-inline-images t))

Hiding emphasis markers is that rich text becomes hard to edit because it is unclear whether your cursor is on the marker or the first or last character.  The [org-appear.el](https://github.com/awth13/org-appear) helps by displaying the markers while the cursor is on a rich text word.

When I'm editing the headline, I adjust the headline level with the `tab` key. So `C-a` return to before leading star is not appropriate, I always expect to change the first word of the headline instead of changing the level.  Set `org-special-ctrl-a/e` to move cursor to the beginning of headline when press `C-a`.  The same is applied to `C-e`, which moves to the end of the headline when editing a folded block.

    (use-package org
      :ensure t
      :pin gnu
      :defer t
      :config
      (setq org-special-ctrl-a/e t))

    (use-package org-appear
      :ensure t
      :pin melpa
      :config
      (setq org-appear-autolinks t)
      :hook
      (org-mode-hook . org-appear-mode))

The asterisk characters used by Org mode to indicate heading levels are practical but look a bit ugly.  The previous configuration already removed the leading stars to reduce clutter.  Next I will replace these symbols with some nice icons.

The [org-modern.el](https://github.com/minad/org-modern) improves the look of Org Mode headings by replacing the asterisk symbols with nicer looking circles.  The package also enhances the looks of plain lists, todo items, and tables.

    (use-package org-modern
      :ensure t
      :pin gnu
      :config
      ;; Set headline stars use zero width space.
      (setq org-modern-star '("\u200b"))
    
      ;; Hide all leading stars.
      (setq org-modern-hide-stars t)
      :hook
      (org-mode-hook . org-modern-mode))

Let tags align to the end of headline, it will give a better display.

    (use-package org
      :ensure t
      :pin gnu
      :defer t
      :config
      ;; Tags align
      (setq org-auto-align-tags nil
    	org-tags-column 0))

**Org Mode** have some export option for export Org file to other file format.  But I need hide them when writing.

    (use-package org
      :ensure t
      :pin gnu
      :config
      (setq org-hidden-keywords '(title
    			      author
    			      date
    			      email
    			      tags
    			      options
    			      export_file_name)))


### Show Outline Tree

**Org Mode** supports jumping between sections and can also use `occur` to match the headline.   However, I still need an intuitive idea of the structure of the current file when writing so-long files.  I use a command `consult-org-heading` provide by [consult.el](https://github.com/minad/consult) to preview heading and jump into it.

    (use-package consult
      :ensure t
      :pin gnu
      :commands consult-org-heading)
    
    (use-package org
      :ensure t
      :pin gnu
      :defer t
      :config
      (keymap-set org-mode-map "M-s M-h" 'consult-org-heading))


### Distraction-free Org writing

Full concentration to write Org file.

    (use-package olivetti
      :ensure t
      :pin melpa
      :hook
      (org-mode-hook . olivetti-mode))


### Export to other file formats

At some point I want to export my **Org** file to other file formats, such as publish them on the web, or share them with people not using **Org**.  **Org Mode** use *ox.el* to support for conversion to other files.  But it only activate supports of **HTML** file, **ASCII** file, **Plain** text, **ODT** (Open Document Text) file by default, and I want to get more types support.


#### Markdown

**Markdown** is a popular lightweight markup language for creating formatted text.  It is the default document format that most people use.  So I need easily convert to it to share with the people who use it.

Require *ox-md.el* to auto extended Markdown support of  `org-export-dispatch`.

    (use-package ox-md
      :ensure org
      :pin gnu
      :after org)


<a id="orgbe51a11"></a>

# Programming

Emacs is most powerful programming environment.  But it is required to be configured in detail, otherwise it will be poor.  Let me configure Emacs for all programming languages I use.


<a id="org8f1bdf6"></a>

## Generic programming enhancement

Display the number of current line and highlight current line when I am programming.

    (use-package display-line-numbers
      :hook
      (prog-mode-hook . display-line-numbers-mode))
    
    (use-package hl-line
      :hook
      (prog-mode-hook . hl-line-mode))

I have already configured corfu to complete text, activate it when I am programming.

    (use-package corfu
      :ensure t
      :pin gnu
      :hook
      (prog-mode-hook . corfu-mode))


### Back to Indentation or Beginning

Most the real code has the indented structure, and Emacs will move to the beginning of line when press `C-a` by default.  But most times, I mean move to the beginning of code rather than the line.

    (use-package mwim
      :ensure t
      :pin melpa
      :after prog-mode
      :commands
      (mwim-beginning
       mwim-end)
      :init
      (keymap-set prog-mode-map "C-a" 'mwim-beginning)
      (keymap-set prog-mode-map "C-e" 'mwim-end))


### Emacs with Tree-sitter

> Tree-sitter is a parser generator tool and an incremental parsing library. It can build a concrete syntax tree for a source file and efficiently update the syntax tree as the source file is edited. <sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>

I use Tree-sitter in Emacs to get faster and fine-grained code highlighting, and more flexible code folding.

Not all programming languages I used support it, so I handle it in the major mode that support it.

    (use-package tree-sitter
      :ensure t
      :pin melpa
      :commands tree-sitter-mode)
