README.md


### Language Server Protocol

> The Language Server Protocol (LSP) defines the protocol used between an editor or IDE and a language server that provides language features like auto complete, go to definition, find all references etc. The goal of the Language Server Index Format (LSIF, pronounced like "else if") is to support rich code navigation in development tools or a Web UI without needing a local copy of the source code.<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>

To get the LSP support, [lsp-mode.el](https://github.com/emacs-lsp/lsp-mode) and [eglot.el](https://github.com/joaotavora/eglot) both are available for me.  Some people used [lsp-mode.el](https://github.com/emacs-lsp/lsp-mode), but I preferred to use [eglot.el](https://github.com/joaotavora/eglot).  Because [eglot.el](https://github.com/joaotavora/eglot) is considerably less code and hassle than [lsp-mode.el](https://github.com/emacs-lsp/lsp-mode).  In most cases, there's nothing to configure. It's a minimalist approach focused on user experience and performance.

And not all programming languages I used need LSP, so I handle it in the major mode that I really need to use.

    (use-package eglot
      :ensure t
      :pin gnu
      :commands eglot-ensure
      :config
      ;; Auto kill `eglot' server after kill last modifed buffer.
      (setq eglot-autoshutdown t)
    
      ;; Remove `eglot' mode line status information.
      (setq mode-line-misc-info
    	(delete `(eglot--managed-mode
    		  (" [" eglot--mode-line-format "] "))
    		mode-line-misc-info)))


### Find definition and references

Use *xref.el* find definition and references of functions and variables, and get preview feature with [consult.el](https://github.com/minad/consult).

    (use-package xref
      :defines
      (xref-show-xrefs-function
       xref-show-definitions-function))
    
    (use-package consult
      :ensure t
      :pin gnu
      :after xref
      :autoload consult-xref
      :init
      (setq xref-show-xrefs-function #'consult-xref
    	xref-show-definitions-function #'consult-xref))


### On-the-fly syntax checker

Syntax checker checks for syntax errors in each statement, according to the data set type.  And on-the-fly syntax checker show diagnostics while the change affects of code is ongoing.  It help me to write high quality and bug-free code.

I used built-in *flymake.el* rather than [flycheck.el](https://github.com/flycheck/flycheck).


### Show diagnostics in minions menu

I use **Minions Mode** to hide minor modes I don't want to see, and exception and counters of diagnostics will be hide by default.  Exclude it to display in Minions Menu directly.

    (use-package minions
      :ensure t
      :pin melpa
      :defines minions-prominent-modes)
    
    (use-package flymake
      :defer t
      :after minions
      :config
      (when minions-mode
        (push 'flymake-mode minions-prominent-modes)))


### Show diagnostics with preview

Use `completing-read` to jumping between diagnostics, and get preview features from [consult.el](https://github.com/minad/consult).

    (use-package consult
      :ensure t
      :pin gnu
      :after flymake
      :commands consult-flymake
      :init
      (keymap-set flymake-mode-map "C-c !" 'consult-flymake))


<a id="orga5c4347"></a>

## C/C++

    (use-package tree-sitter
      :ensure t
      :pin melpa
      :hook
      ((c-mode-hook . tree-sitter-mode)
       (c++-mode-hook . tree-sitter-mode)))
    
    (use-package eglot
      :ensure t
      :pin gnu
      :hook
      ((c-mode-hook . eglot-ensure)
       (c++-mode-hook . eglot-ensure)))


<a id="orgef3b59e"></a>

## Emacs Lisp

I use [inspector.el](https://github.com/mmontone/emacs-inspector) to inspect the Emacs Lisp objects.

    (use-package inspector
      :ensure t
      :pin gnu
      :after elisp-mode
      :commands
      (inspector-inspect-last-sexp
       inspector-inspect-expression)
      :init
      (keymap-set emacs-lisp-mode-map
    	      "C-c C-i"
    	      'inspector-inspect-last-sexp)
      (keymap-set emacs-lisp-mode-map
    	      "C-c M-i"
    	      'inspector-inspect-expression))

Emacs Lisp Macros enable I to define new control constructs and other language features.  I use it everyday, *pp.el* is helpful to display pretty expansion of macros.

    (use-package pp
      :after elisp-mode
      :commands
      (pp-macroexpand-last-sexp
       pp-macroexpand-expression)
      :init
      (keymap-set emacs-lisp-mode-map
    	      "C-c <return>"
    	      'pp-macroexpand-last-sexp)
      (keymap-set emacs-lisp-mode-map
    	      "C-c M-<return>"
    	      'pp-macroexpand-expression))


<a id="orgee98647"></a>

## Haskell

    (use-package haskell-mode
      :ensure t
      :pin nongnu
      :commands haskell-mode)
    
    (use-package tree-sitter
      :ensure t
      :pin melpa
      :hook
      (haskell-mode-hook . tree-sitter-mode))
    
    (use-package eglot
      :ensure t
      :pin gnu
      :hook
      (haskell-mode-hook . eglot-ensure))


<a id="orgf263745"></a>

## Rust

    (use-package rust-mode
      :ensure t
      :pin nongnu
      :commands rust-mode)
    
    (use-package tree-sitter
      :ensure t
      :pin melpa
      :hook
      (rust-mode-hook . tree-sitter-mode))
    
    (use-package eglot
      :ensure t
      :pin gnu
      :hook
      (rust-mode-hook . eglot-ensure))


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> <https://github.com/minad/marginalia#marginaliael---marginalia-in-the-minibuffer>

<sup><a id="fn.2" href="#fnr.2">2</a></sup> <https://en.wikipedia.org/wiki/Drag_and_drop>

<sup><a id="fn.3" href="#fnr.3">3</a></sup> <https://tree-sitter.github.io/tree-sitter/>

<sup><a id="fn.4" href="#fnr.4">4</a></sup> <https://microsoft.github.io/language-server-protocol/>
